/*----------------------------------------------------------------------------------------------------------
  文件名  :  MatrixKey.h   ( msp430版 )
  描述    :  4*4矩阵键盘驱动包   (有包括4个独立按键)
  			 See MatrixKey.c for more info
  日期	  :  2014-8-8
  制作人  :  Beny
----------------------------------------------------------------------------------------------------------*/
#ifndef _MATRIXKEY_H_
#define _MATRIXKEY_H_




//  矩阵键盘宏定义---------------------------------------------------------------------
#define NO_KEY_PRESS				20		// 无按键按下的 键值

/* -----以下参数需根据实际情况做相应的 修改----- */
#define	KEY_STATUS_noKeyPress			0
#define KEY_STATUS_filter			1
#define KEY_STATUS_clicking			2
#define KEY_STATUS_longKeyPress			3
#define KEY_STATUS_Release			4

#define KEY_FILTER_TIME	100		// 按键抖动 时间			(大于这个时间认为消抖完成，在这个时间内认为是按键抖动状态)
#define LONG_PRESS_TIME	900		// 确定 按键长按 的时间		(大于这个时间，认为 发生按键长按事件)
#define QUICK_ACT_SPACE	1000		// 按键 连发 时间间隔
//--------------------------------------------------------------------------------















//  矩阵键盘---------------------------------------------------------------------------
extern unsigned char KeyScan (void);
extern unsigned char GetKeyValue (void);
//-------------------------------------------------------------------------------------





#endif










